Revit 2027 API
TableSectionData.GetColumnWidthInPixels Method
 This returns a column's width in logical pixels
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetColumnWidthInPixels(
	int nCol
)
Public Function GetColumnWidthInPixels (
	nCol As Integer
) As Integer
public:
int GetColumnWidthInPixels(
	int nCol
)
member GetColumnWidthInPixels :
        nCol : int -> int
Parameters
nCol Int32
Return Value
Int32
Exceptions
Exception | Condition
ArgumentException |  The given column number nCol is invalid.
See Also
Reference
TableSectionData Class
Autodesk.Revit.DB Namespace